###################################################################

# Created by write_sdc on Tue Jan 20 21:12:28 2026

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions slow -library slow
set_load -pin_load 0.05 [get_ports out_valid]
set_load -pin_load 0.05 [get_ports {out[59]}]
set_load -pin_load 0.05 [get_ports {out[58]}]
set_load -pin_load 0.05 [get_ports {out[57]}]
set_load -pin_load 0.05 [get_ports {out[56]}]
set_load -pin_load 0.05 [get_ports {out[55]}]
set_load -pin_load 0.05 [get_ports {out[54]}]
set_load -pin_load 0.05 [get_ports {out[53]}]
set_load -pin_load 0.05 [get_ports {out[52]}]
set_load -pin_load 0.05 [get_ports {out[51]}]
set_load -pin_load 0.05 [get_ports {out[50]}]
set_load -pin_load 0.05 [get_ports {out[49]}]
set_load -pin_load 0.05 [get_ports {out[48]}]
set_load -pin_load 0.05 [get_ports {out[47]}]
set_load -pin_load 0.05 [get_ports {out[46]}]
set_load -pin_load 0.05 [get_ports {out[45]}]
set_load -pin_load 0.05 [get_ports {out[44]}]
set_load -pin_load 0.05 [get_ports {out[43]}]
set_load -pin_load 0.05 [get_ports {out[42]}]
set_load -pin_load 0.05 [get_ports {out[41]}]
set_load -pin_load 0.05 [get_ports {out[40]}]
set_load -pin_load 0.05 [get_ports {out[39]}]
set_load -pin_load 0.05 [get_ports {out[38]}]
set_load -pin_load 0.05 [get_ports {out[37]}]
set_load -pin_load 0.05 [get_ports {out[36]}]
set_load -pin_load 0.05 [get_ports {out[35]}]
set_load -pin_load 0.05 [get_ports {out[34]}]
set_load -pin_load 0.05 [get_ports {out[33]}]
set_load -pin_load 0.05 [get_ports {out[32]}]
set_load -pin_load 0.05 [get_ports {out[31]}]
set_load -pin_load 0.05 [get_ports {out[30]}]
set_load -pin_load 0.05 [get_ports {out[29]}]
set_load -pin_load 0.05 [get_ports {out[28]}]
set_load -pin_load 0.05 [get_ports {out[27]}]
set_load -pin_load 0.05 [get_ports {out[26]}]
set_load -pin_load 0.05 [get_ports {out[25]}]
set_load -pin_load 0.05 [get_ports {out[24]}]
set_load -pin_load 0.05 [get_ports {out[23]}]
set_load -pin_load 0.05 [get_ports {out[22]}]
set_load -pin_load 0.05 [get_ports {out[21]}]
set_load -pin_load 0.05 [get_ports {out[20]}]
set_load -pin_load 0.05 [get_ports {out[19]}]
set_load -pin_load 0.05 [get_ports {out[18]}]
set_load -pin_load 0.05 [get_ports {out[17]}]
set_load -pin_load 0.05 [get_ports {out[16]}]
set_load -pin_load 0.05 [get_ports {out[15]}]
set_load -pin_load 0.05 [get_ports {out[14]}]
set_load -pin_load 0.05 [get_ports {out[13]}]
set_load -pin_load 0.05 [get_ports {out[12]}]
set_load -pin_load 0.05 [get_ports {out[11]}]
set_load -pin_load 0.05 [get_ports {out[10]}]
set_load -pin_load 0.05 [get_ports {out[9]}]
set_load -pin_load 0.05 [get_ports {out[8]}]
set_load -pin_load 0.05 [get_ports {out[7]}]
set_load -pin_load 0.05 [get_ports {out[6]}]
set_load -pin_load 0.05 [get_ports {out[5]}]
set_load -pin_load 0.05 [get_ports {out[4]}]
set_load -pin_load 0.05 [get_ports {out[3]}]
set_load -pin_load 0.05 [get_ports {out[2]}]
set_load -pin_load 0.05 [get_ports {out[1]}]
set_load -pin_load 0.05 [get_ports {out[0]}]
create_clock [get_ports clk_1]  -name clk1  -period 14.1  -waveform {0 7.05}
set_clock_uncertainty 0.1  [get_clocks clk1]
set_clock_transition -max -rise 0.1 [get_clocks clk1]
set_clock_transition -max -fall 0.1 [get_clocks clk1]
set_clock_transition -min -rise 0.1 [get_clocks clk1]
set_clock_transition -min -fall 0.1 [get_clocks clk1]
create_clock [get_ports clk_2]  -name clk2  -period 2.5  -waveform {0 1.25}
set_clock_uncertainty 0.1  [get_clocks clk2]
set_clock_transition -max -rise 0.1 [get_clocks clk2]
set_clock_transition -max -fall 0.1 [get_clocks clk2]
set_clock_transition -min -rise 0.1 [get_clocks clk2]
set_clock_transition -min -fall 0.1 [get_clocks clk2]
create_clock [get_ports clk_3]  -name clk3  -period 2.7  -waveform {0 1.35}
set_clock_uncertainty 0.1  [get_clocks clk3]
set_clock_transition -max -rise 0.1 [get_clocks clk3]
set_clock_transition -max -fall 0.1 [get_clocks clk3]
set_clock_transition -min -rise 0.1 [get_clocks clk3]
set_clock_transition -min -fall 0.1 [get_clocks clk3]
set_input_delay -clock clk1  0  [get_ports clk_1]
set_input_delay -clock clk2  0  [get_ports clk_2]
set_input_delay -clock clk3  0  [get_ports clk_3]
set_input_delay -clock clk1  -max 12.05  [get_ports rst_n]
set_input_delay -clock clk1  -min 0  [get_ports rst_n]
set_input_delay -clock clk1  -max 12.05  [get_ports in_valid]
set_input_delay -clock clk1  -min 0  [get_ports in_valid]
set_input_delay -clock clk1  -max 12.05  [get_ports CRC]
set_input_delay -clock clk1  -min 0  [get_ports CRC]
set_input_delay -clock clk1  -max 12.05  [get_ports mode]
set_input_delay -clock clk1  -min 0  [get_ports mode]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[59]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[59]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[58]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[58]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[57]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[57]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[56]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[56]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[55]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[55]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[54]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[54]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[53]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[53]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[52]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[52]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[51]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[51]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[50]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[50]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[49]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[49]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[48]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[48]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[47]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[47]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[46]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[46]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[45]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[45]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[44]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[44]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[43]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[43]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[42]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[42]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[41]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[41]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[40]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[40]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[39]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[39]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[38]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[38]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[37]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[37]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[36]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[36]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[35]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[35]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[34]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[34]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[33]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[33]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[32]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[32]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[31]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[31]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[30]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[30]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[29]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[29]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[28]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[28]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[27]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[27]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[26]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[26]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[25]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[25]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[24]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[24]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[23]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[23]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[22]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[22]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[21]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[21]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[20]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[20]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[19]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[19]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[18]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[18]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[17]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[17]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[16]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[16]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[15]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[15]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[14]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[14]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[13]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[13]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[12]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[12]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[11]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[11]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[10]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[10]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[9]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[9]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[8]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[8]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[7]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[7]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[6]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[6]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[5]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[5]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[4]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[4]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[3]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[3]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[2]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[2]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[1]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[1]}]
set_input_delay -clock clk1  -max 12.05  [get_ports {message[0]}]
set_input_delay -clock clk1  -min 0  [get_ports {message[0]}]
set_output_delay -clock clk3  -max 1.35  [get_ports out_valid]
set_output_delay -clock clk3  -min 0  [get_ports out_valid]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[59]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[59]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[58]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[58]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[57]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[57]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[56]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[56]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[55]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[55]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[54]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[54]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[53]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[53]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[52]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[52]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[51]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[51]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[50]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[50]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[49]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[49]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[48]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[48]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[47]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[47]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[46]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[46]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[45]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[45]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[44]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[44]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[43]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[43]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[42]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[42]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[41]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[41]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[40]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[40]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[39]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[39]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[38]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[38]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[37]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[37]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[36]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[36]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[35]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[35]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[34]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[34]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[33]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[33]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[32]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[32]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[31]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[31]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[30]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[30]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[29]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[29]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[28]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[28]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[27]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[27]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[26]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[26]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[25]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[25]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[24]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[24]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[23]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[23]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[22]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[22]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[21]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[21]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[20]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[20]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[19]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[19]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[18]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[18]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[17]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[17]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[16]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[16]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[15]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[15]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[14]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[14]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[13]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[13]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[12]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[12]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[11]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[11]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[10]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[10]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[9]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[9]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[8]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[8]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[7]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[7]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[6]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[6]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[5]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[5]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[4]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[4]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[3]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[3]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[2]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[2]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[1]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[1]}]
set_output_delay -clock clk3  -max 1.35  [get_ports {out[0]}]
set_output_delay -clock clk3  -min 0  [get_ports {out[0]}]
set_clock_groups  -asynchronous -name clk1_1  -group [get_clocks clk1] -group  \
[get_clocks clk2] -group [get_clocks clk3]
set_input_transition -max 0.5  [get_ports clk_1]
set_input_transition -min 0.5  [get_ports clk_1]
set_input_transition -max 0.5  [get_ports clk_2]
set_input_transition -min 0.5  [get_ports clk_2]
set_input_transition -max 0.5  [get_ports clk_3]
set_input_transition -min 0.5  [get_ports clk_3]
set_input_transition -max 0.5  [get_ports rst_n]
set_input_transition -min 0.5  [get_ports rst_n]
set_input_transition -max 0.5  [get_ports in_valid]
set_input_transition -min 0.5  [get_ports in_valid]
set_input_transition -max 0.5  [get_ports CRC]
set_input_transition -min 0.5  [get_ports CRC]
set_input_transition -max 0.5  [get_ports mode]
set_input_transition -min 0.5  [get_ports mode]
set_input_transition -max 0.5  [get_ports {message[59]}]
set_input_transition -min 0.5  [get_ports {message[59]}]
set_input_transition -max 0.5  [get_ports {message[58]}]
set_input_transition -min 0.5  [get_ports {message[58]}]
set_input_transition -max 0.5  [get_ports {message[57]}]
set_input_transition -min 0.5  [get_ports {message[57]}]
set_input_transition -max 0.5  [get_ports {message[56]}]
set_input_transition -min 0.5  [get_ports {message[56]}]
set_input_transition -max 0.5  [get_ports {message[55]}]
set_input_transition -min 0.5  [get_ports {message[55]}]
set_input_transition -max 0.5  [get_ports {message[54]}]
set_input_transition -min 0.5  [get_ports {message[54]}]
set_input_transition -max 0.5  [get_ports {message[53]}]
set_input_transition -min 0.5  [get_ports {message[53]}]
set_input_transition -max 0.5  [get_ports {message[52]}]
set_input_transition -min 0.5  [get_ports {message[52]}]
set_input_transition -max 0.5  [get_ports {message[51]}]
set_input_transition -min 0.5  [get_ports {message[51]}]
set_input_transition -max 0.5  [get_ports {message[50]}]
set_input_transition -min 0.5  [get_ports {message[50]}]
set_input_transition -max 0.5  [get_ports {message[49]}]
set_input_transition -min 0.5  [get_ports {message[49]}]
set_input_transition -max 0.5  [get_ports {message[48]}]
set_input_transition -min 0.5  [get_ports {message[48]}]
set_input_transition -max 0.5  [get_ports {message[47]}]
set_input_transition -min 0.5  [get_ports {message[47]}]
set_input_transition -max 0.5  [get_ports {message[46]}]
set_input_transition -min 0.5  [get_ports {message[46]}]
set_input_transition -max 0.5  [get_ports {message[45]}]
set_input_transition -min 0.5  [get_ports {message[45]}]
set_input_transition -max 0.5  [get_ports {message[44]}]
set_input_transition -min 0.5  [get_ports {message[44]}]
set_input_transition -max 0.5  [get_ports {message[43]}]
set_input_transition -min 0.5  [get_ports {message[43]}]
set_input_transition -max 0.5  [get_ports {message[42]}]
set_input_transition -min 0.5  [get_ports {message[42]}]
set_input_transition -max 0.5  [get_ports {message[41]}]
set_input_transition -min 0.5  [get_ports {message[41]}]
set_input_transition -max 0.5  [get_ports {message[40]}]
set_input_transition -min 0.5  [get_ports {message[40]}]
set_input_transition -max 0.5  [get_ports {message[39]}]
set_input_transition -min 0.5  [get_ports {message[39]}]
set_input_transition -max 0.5  [get_ports {message[38]}]
set_input_transition -min 0.5  [get_ports {message[38]}]
set_input_transition -max 0.5  [get_ports {message[37]}]
set_input_transition -min 0.5  [get_ports {message[37]}]
set_input_transition -max 0.5  [get_ports {message[36]}]
set_input_transition -min 0.5  [get_ports {message[36]}]
set_input_transition -max 0.5  [get_ports {message[35]}]
set_input_transition -min 0.5  [get_ports {message[35]}]
set_input_transition -max 0.5  [get_ports {message[34]}]
set_input_transition -min 0.5  [get_ports {message[34]}]
set_input_transition -max 0.5  [get_ports {message[33]}]
set_input_transition -min 0.5  [get_ports {message[33]}]
set_input_transition -max 0.5  [get_ports {message[32]}]
set_input_transition -min 0.5  [get_ports {message[32]}]
set_input_transition -max 0.5  [get_ports {message[31]}]
set_input_transition -min 0.5  [get_ports {message[31]}]
set_input_transition -max 0.5  [get_ports {message[30]}]
set_input_transition -min 0.5  [get_ports {message[30]}]
set_input_transition -max 0.5  [get_ports {message[29]}]
set_input_transition -min 0.5  [get_ports {message[29]}]
set_input_transition -max 0.5  [get_ports {message[28]}]
set_input_transition -min 0.5  [get_ports {message[28]}]
set_input_transition -max 0.5  [get_ports {message[27]}]
set_input_transition -min 0.5  [get_ports {message[27]}]
set_input_transition -max 0.5  [get_ports {message[26]}]
set_input_transition -min 0.5  [get_ports {message[26]}]
set_input_transition -max 0.5  [get_ports {message[25]}]
set_input_transition -min 0.5  [get_ports {message[25]}]
set_input_transition -max 0.5  [get_ports {message[24]}]
set_input_transition -min 0.5  [get_ports {message[24]}]
set_input_transition -max 0.5  [get_ports {message[23]}]
set_input_transition -min 0.5  [get_ports {message[23]}]
set_input_transition -max 0.5  [get_ports {message[22]}]
set_input_transition -min 0.5  [get_ports {message[22]}]
set_input_transition -max 0.5  [get_ports {message[21]}]
set_input_transition -min 0.5  [get_ports {message[21]}]
set_input_transition -max 0.5  [get_ports {message[20]}]
set_input_transition -min 0.5  [get_ports {message[20]}]
set_input_transition -max 0.5  [get_ports {message[19]}]
set_input_transition -min 0.5  [get_ports {message[19]}]
set_input_transition -max 0.5  [get_ports {message[18]}]
set_input_transition -min 0.5  [get_ports {message[18]}]
set_input_transition -max 0.5  [get_ports {message[17]}]
set_input_transition -min 0.5  [get_ports {message[17]}]
set_input_transition -max 0.5  [get_ports {message[16]}]
set_input_transition -min 0.5  [get_ports {message[16]}]
set_input_transition -max 0.5  [get_ports {message[15]}]
set_input_transition -min 0.5  [get_ports {message[15]}]
set_input_transition -max 0.5  [get_ports {message[14]}]
set_input_transition -min 0.5  [get_ports {message[14]}]
set_input_transition -max 0.5  [get_ports {message[13]}]
set_input_transition -min 0.5  [get_ports {message[13]}]
set_input_transition -max 0.5  [get_ports {message[12]}]
set_input_transition -min 0.5  [get_ports {message[12]}]
set_input_transition -max 0.5  [get_ports {message[11]}]
set_input_transition -min 0.5  [get_ports {message[11]}]
set_input_transition -max 0.5  [get_ports {message[10]}]
set_input_transition -min 0.5  [get_ports {message[10]}]
set_input_transition -max 0.5  [get_ports {message[9]}]
set_input_transition -min 0.5  [get_ports {message[9]}]
set_input_transition -max 0.5  [get_ports {message[8]}]
set_input_transition -min 0.5  [get_ports {message[8]}]
set_input_transition -max 0.5  [get_ports {message[7]}]
set_input_transition -min 0.5  [get_ports {message[7]}]
set_input_transition -max 0.5  [get_ports {message[6]}]
set_input_transition -min 0.5  [get_ports {message[6]}]
set_input_transition -max 0.5  [get_ports {message[5]}]
set_input_transition -min 0.5  [get_ports {message[5]}]
set_input_transition -max 0.5  [get_ports {message[4]}]
set_input_transition -min 0.5  [get_ports {message[4]}]
set_input_transition -max 0.5  [get_ports {message[3]}]
set_input_transition -min 0.5  [get_ports {message[3]}]
set_input_transition -max 0.5  [get_ports {message[2]}]
set_input_transition -min 0.5  [get_ports {message[2]}]
set_input_transition -max 0.5  [get_ports {message[1]}]
set_input_transition -min 0.5  [get_ports {message[1]}]
set_input_transition -max 0.5  [get_ports {message[0]}]
set_input_transition -min 0.5  [get_ports {message[0]}]
